projecto/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
	  if params[:tag]
	    @projects = Project.tagged_with(params[:tag])
	  else
	    @projects = Project.all

INSERT INTO "projects" ("category", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category", "others"], ["created_at", Sun, 01 Sep 2013 05:06:28 UTC +00:00], ["name", "test"], ["updated_at", Sun, 01 Sep 2013 05:06:28 UTC +00:00]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save